v2206/Projects/solverTests/ADTank/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    GeoTank
    {
        type triSurfaceMesh;
        file "GeoTank.stl";
    }

    // GeoTank
    // {
    //     type triSurfaceMesh;
    //     file "GeoTank_ss.stl";
    // }
    
    GeoShaft
    {
        type triSurfaceMesh;
        file "GeoShaft_ss.stl";
    }

    //- Used to define MRF zone and refine mesh round the GeoShaft 
    MRF
    {
        // type            searchableCone;
        // point1          (0  0 -81);
        // radius1         51;
        // innerRadius1    39;
        // point2          (0  0  80);
        // radius2         51;
        // innerRadius2    39;

        type searchableCylinder;
        point1 (0.0  0.0  -81);
        point2 (0.0  0.0   81);
        radius 51;
    }
}


castellatedMeshControls
{

    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30; // 90;

    features
    (
        {
            file "GeoTank.eMesh";
            level 2;
        }

        // {
        //     file "GeoTank_ss.eMesh";
        //     level 2;
        // }

        {
            file "GeoShaft_ss.eMesh";
            level 4;
        }
    );

    refinementSurfaces
    {
        MRF
        {
            level (1 1);
            cellZone cellMRFzone;
            faceZone faceMRFzone;
            cellZoneInside inside;
        }

        GeoTank
        {
            level (3 3);
        }

        GeoShaft
        {
            level (5 5);
        }

    }

    refinementRegions
    {
        MRF
        {
            mode inside;
            levels ((1E15 2)); // ((1E15 1));
        }
    }

    locationInMesh (20 20 20); // Inside point
    allowFreeStandingZoneFaces false; // true;
    useLeakClosure  true;
}

// Settings for the snapping.
snapControls
{
    nSmoothPatch            3;
    tolerance               1.0;
    nSolveIter              30;
    nRelaxIter              10;
    nFeatureSnapIter        10;
    explicitFeatureSnap     true;
    implicitFeatureSnap     false;
    multiRegionFeatureSnap  false;
    // nFaceSplitInterval      5;
}

// Settings for the layer addition.
addLayersControls
{
    layers
    {
        GeoTank
        {
            nSurfaceLayers 2;
        }

        GeoShaft
        {
            nSurfaceLayers 4;
        }
    }

    relativeSizes           true;
    expansionRatio          1.5;
    finalLayerThickness     0.5;
    minThickness            0.2;
    nGrow                   0;

    featureAngle            60;
    slipFeatureAngle        30;
    nRelaxIter              3;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle      90; // 60;
    nBufferCellsNoExtrude   0;

    nLayerIter              30;
    nRelaxedIter            10;
}

meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        maxNonOrtho 55;
    }
}

writeFlags
(
);

mergeTolerance 1E-6;


// ************************************************************************* //
